{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/10/06/hello-world/"},{"title":"","text":"建置網站紀錄架站緣由原本想要一個較個人風的 email參照 網路上 得知 Google Domains 不只提供 domain 同時提供指定 email 轉寄的功能就直接照 這篇 來購買一個 domainGoogle 相較其他網域商，雖然價格貴一點點，但每年價格都很一致不像有些強打第一年優惠但第二年以後價格快翻倍跳反而比 Google 的還貴在這邊最便宜的一年 9 USD，商用字詞的約 1X USD 即可入手 (我是買 12 USD 的) 設定 Email 轉寄 購買網域後，進入設定頁 -&gt; 電子郵件 最下方 “電子郵件轉寄” 填入你想要的別名與轉寄的地址，儲存後就會轉寄了 利用 Hexo + Github page 建立免費的靜態 Blog所需環境與工具 一個 GitHub 帳號 NodeJS Git 建立一個 Repository 登入 GitHub 建立 Repository name 填入 “yourname.github.io” (yourname 請改成你的 GitHub ID)下方的 type 記得請勾選 “public” 安裝 Hexo1234$ npm i hexo-cli -g$ hexo init blog$ cd blog$ npm i 安裝 Hexo Git1$ npm i hexo-deployer-git 安裝 Blog 主題這邊我們以安裝 minos 為例子其中 minos 需要 hexo-renderer-sass 這個套件12$ git clone https://github.com/ppoffice/hexo-theme-minos.git themes/minos$ npm i hexo-renderer-sass 調整設定在 blog 資料夾內可以看到 “_config.yml” 這個設定檔案打開後在中下方有個 theme 的部分改成:1theme: minos 最下方 deploy 的部分則改成:1234deploy: type: git repository: http://github.com/yourname/yourname.github.io.git branch: master 這裡的 “yourname” 改成你的 github 帳號 其他更詳細的設定可參考這裡 開啟 Server1$ hexo s 預設在 http://localhost:4000 看 Local Page (裡面會有一篇 Hello World) 建置靜態網頁把 Markdown File 轉成網頁1$ hexo g 發佈到 GitHub Page 上1$ hexo d 或是你也可以建置、發佈一起做1$ hexo d -g 網站轉址既然我們已經有 Google Domain 跟 Hexo + GitHub Page 產的 Blog該是串起來的時候了 設定 DNS到 Google Domains 設定頁 -&gt; DNS -&gt; 自訂資源紀錄添加一筆 Type A，IP 如下: 185.199.108.153 185.199.109.153 185.199.110.153 185.199.111.153 再添加一筆 CNAME:name 填 subdomain (例如 “blog”)data 填 “yourname.github.io” (yourname 請改成你的 github ID) 填完顯示如下: 設定 GitHub Page 的 Domain 在 /blog/source 資料夾建立 CNAME 檔案 12$ cd /blog/source$ touch CNAME 檔案內填寫入 1subdomain.domain.com 假設我的 subdomain 是 “blog” 我買的 domain 是 “brchen777.com” 那在這邊要填入的會是 “blog.brchen777.com” 假設有填好，進入 GitHub Repository -&gt; Settings -&gt; GitHub Pages 區塊 會有 “Your site is published at XXX” 的訊息，其中 XXX 就是 blog 的網址，顯示如下: 參考資料 在 Google Domains 註冊購買網域名稱教學 Hexo+GitHub，新手也可以快速建立部落格 如何搭建個人 Blog 使用 Hexo + Gitpage Hexo - 前端也能建置部落格！更換主題與發表文章篇 Configuring a custom domain for your GitHub Pages site 自訂網域名稱：Google Domain","link":"/2019/10/06/建置網站紀錄/"}],"tags":[],"categories":[]}